<!DOCTYPE html>
<html>
  <head>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta charset="UTF-8">
    <title>
      L&rsquo;Ar&egrave;ne du Palais
    </title>
  </head>
​
  <body>
    <link rel="stylesheet" href="../css/palacearena.css">
    <link rel="stylesheet" href="../css/sad.css">
    <link rel="stylesheet" href="../css/popuptest.css">
    <link rel="stylesheet" href="../css/footer.css">

<!--nav-->
<nav class="sideNav">
  <a href="#" class="closeBtn">x</a>
  <a href="index-fr.html">Page d'accueil</a>
  <a href="marcypalace-fr.html">Palais Marcy</a>
  <a href="hallofwarriors-fr.html">Guerri&egrave;res</a>
  <a href="palacearena-fr.html">Invicta 2021</a>
  <a href="robot-fr.html">Robot</a>
  <a href="peachgrove-fr.html">Notre Histoire</a>
  <a href="noodleshop-fr.html">Alli&eacute;s</a>
  <a href="../index.html">Anglais</a>
</nav>

<button class="openSideNav">
  <div class="hamburger"></div>
  <div class="hamburger"></div>
  <div class="hamburger"></div>
</button>

<!--header-->
  <header>
    <h1 class="header-txt">Ar&egrave;ne du Palais</h1>
  </header>

<div class="content-background">
<!--popup-->
<aside class="popup" onclick="myFunction()">
  <img src="../images/icon-sooth.PNG" alt="Icon de Soothsayer" width="220px">
  <span class="popuptext" id="myPopup">Votre histoire n&rsquo;a peut-&ecirc;tre pas un d&eacute;but aussi heureux, mais cela ne fait pas de vous ce que vous &ecirc;tes, c&rsquo;est le reste - qui vous choisissez d&rsquo;&ecirc;tre. Il y a un grand danger qui menace la vall&eacute;e de la paix et nous avons besoin de votre aide pour avoir notre fin heureuse.</span>
</aside>

<!--content-->
  <section class="section">
    <img class="img" src="../images/crc.png" alt="Logo CRC">
    <p class="text"> Depuis longtemps, la CRC travaille sur une machine qui pourra apporter la paix dans le monde. La CRC est compos&eacute;e de plusieurs b&eacute;n&eacute;voles d&eacute;vou&eacute;s envers les sciences et les arts voulant partager cet amour aux g&eacute;n&eacute;rations futures. Cet organisme, &agrave; but non lucratif, permet aux adolescents de d&eacute;couvrir de nouveaux domaines et peut-&ecirc;tre une nouvelle passion. Leur originalit&eacute; et leur cr&eacute;ativit&eacute; permettent de cr&eacute;er, chaque ann&eacute;e, des comp&eacute;titions plus amusantes les unes que les autres. &eacute;tant compos&eacute;e de plusieurs domaines dont les sciences (la programmation et la construction), les arts (la cr&eacute;ation d&rsquo;un kiosque), les langues et le multim&eacute;dia (le dessin 3D, la cr&eacute;ation d&rsquo;un site web et d&rsquo;une vid&eacute;o), la CRC survole de nombreux aspects. Gr&acirc;ce &agrave; la CRC, durant les mois de pr&eacute;parations avant la comp&eacute;tition, les gens apprennent &agrave; travailler en &eacute;quipe et acqui&egrave;rent de nouvelles connaissances pouvant &ecirc;tre tr&egrave;s utiles dans le futur, ainsi qu&rsquo;&agrave; g&eacute;rer efficacement leur temps.
    </p>
    <img class="img-half" src="../images/crc-old1.jpg" alt="Robotique Marcelline &agrave; la Comp&eacute;tition CRC 2017">
    <img class="img-half" src="../images/crc-old2.jpg" alt="L&rsquo;&eacute;quipe Robotique Marcelline &agrave; la Comp&eacute;tition CRC 2018">
    
    <p class="text"> Quelques mois auparavant, l&rsquo;exp&eacute;rience que la CRC concoctait a tourn&eacute; au cauchemar! Seigneur Shen, voulant prendre sa revanche suite &agrave; son humiliante d&eacute;faite contre les cinq cyclones, est entr&eacute; par effraction dans le laboratoire secret de la CRC et a pirat&eacute; le syst&egrave;me. Il a pris le contr&ocirc;le de leur machine et l&rsquo;a rendue diabolique. Le lendemain matin, la CRC a d&eacute;couvert, avec horreur, leur machine debout et pr&ecirc;te &agrave; les attaquer au simple mouvement. Invicta s&rsquo;est alors enfui et s&rsquo;est dirig&eacute; en direction de la vall&eacute;e de la paix les laissant sous le choc. En effet, c&rsquo;est l&agrave; que les guerriers ont humili&eacute; seigneur Shen et ont d&eacute;truit ses r&ecirc;ves.</p>
    <img class="img" src="../images/invicta.png" alt="Logo Invicta 2021">
    <p class="text"> Sachant que la Vall&eacute;e de la Paix &eacute;tait menac&eacute;e d&rsquo;un danger mortel, la CRC a d&eacute;cid&eacute; de se joindre aux c&ocirc;t&eacute;s des guerri&egrave;res pour chasser Invicta. Pour se faire, nous devons participer &agrave; une comp&eacute;tition qui se d&eacute;roule du 15 au 17 avril 2021 et la gagner, le but &eacute;tant d&rsquo;accumuler le plus de points possible en construisant la structure la plus complexe.. 
      <br><br>
      Le combat se passera ainsi: 
      <ol class="text">
        <li>Dans un d&eacute;lai de 5 minutes, il faudra construire des structures gr&acirc;ce &agrave; diff&eacute;rents types de blocs donn&eacute;s. </li>
        <br><li>Le terrain est divis&eacute; en 7 parties: o&ugrave;  le robot commence, o&ugrave;  il faut construire la structure et les 5 autres parties regroupant les diff&eacute;rents types de morceaux de bois donn&eacute;s.</li>
        <br><li>Des points de difficult&eacute; seront accord&eacute;s &agrave; chaque structure. La plus complexe vaudra le plus.</li>
        <br>
        <iframe class="model" src="https://marcelline5.autodesk360.com/shares/public/SH56a43QTfd62c1cd968b2c572c57dbaa3e4?mode=embed" allowfullscreen="true" webkitallowfullscreen="true" mozallowfullscreen="true"  frameborder="0"></iframe>
        <br>
        <li>Lorsque la structure est compl&eacute;t&eacute;e, il faut prendre la petite balle et la placer dans le cerceau se trouvant dans le coin du terrain de combat pour s&eacute;curiser nos points. Le plus vite que la structure sera finie et que la balle sera plac&eacute;e dans son cerceau, le plus de points bonus elle ajoutera au total, car elle sert de multiplicateur.</li>
        <br><li>Si la structure s&rsquo;effondre par malheur &agrave; la fin du temps ou qu&rsquo;elle est incompl&egrave;te, aucun bonus ne sera accord&eacute;.</li>
        <br><li>Chaque morceau de bois de diff&eacute;rente forme donne un nombre de points respectifs. Le total des points sera le r&eacute;sultat de ceux de la structure et de ceux de chacun des morceaux de bois, multipli&eacute; par le bonus de la balle.</li>
            <img class="img-3" src="../images/structure2.jpg" alt="Structure Invicta #15">
            <img class="img-3" src="../images/structure1.jpg" alt="Structure Invicta #17">
            <img class="img-3" src="../images/structure3.jpg" alt="Structure Invicta #23">
      </ol>
    </p>
​  </section>

<!--tutorial-->
<h2 class="tutorial"> Vid&eacute;o</h2>
<h2 class="tutorial"> Video</h2>
<iframe class="video" src="https://www.youtube.com/embed/7_JF28uj_6s" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<h2 class="tutorial"> Tutorial</h2>
<iframe class="video" src="https://www.youtube.com/embed/irEUrXMr82A" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</iframe>
​
</div>

<!--FOOTER-->
<footer>
  <section class="ft-main">
  <section class="ft-section">
      <h2 class="ft-title">Explorez</h2>
      <ul class="u-list">
        <li class="list-item"><a href="index-fr.html" class="ft-link">Page d'accueil</a></li>
        <li class="list-item"><a href="../french/marcypalace-fr.html" class="ft-link">Palais Marcy</a></li>
        <li class="list-item"><a href="../french/hallofwarriors-fr.html" class="ft-link">Guerri&egrave;res</a></li>
        <li class="list-item"><a href="../french/palacearena-fr.html" class="ft-link">Invicta 2021</a></li>
        <li class="list-item"><a href="../french/robot-fr.html" class="ft-link">Robot</a></li>
        <li class="list-item"><a href="../french/peachgrove-fr.html" class="ft-link">Notre Histoire</a></li>
        <li class="list-item"><a href="../french/noodleshop-fr.html" class="ft-link">Alli&eacute;s</a></li>
        <li class="list-item"><a href="../index.html" class="ft-link">Anglais</a></li>
      </ul>
  </section>
  <section class="ft-section">
      <h2 class="ft-title">Remerciements</h2>
        <p>Dessins par Victoria Hoang</p>
        <p>Photos par Emily Hoang, Camille Jean-Fran&ccedil;ois et Catherine Louca</p>
        <p>Bas&eacute; sur Kung Fu Panda de DreamWorks</p>
      <br>
      <p>&copy; 2021 Robotique Marcelline</p>
  </section>
  </section>
</footer>

<script>
  let openBtn = document.querySelector(".openSideNav");
  openBtn.addEventListener("click", () => {
     showNav();
  });
  let closeBtn = document.querySelector(".closeBtn");
  closeBtn.addEventListener("click", () => {
     hideNav();
  });
  function showNav() {
     document.querySelector(".sideNav").style.width = "300px";
     document.querySelector('.main-content').style.marginLeft = "300px";
  }
  function hideNav() {
     document.querySelector(".sideNav").style.width = "0";
     document.querySelector('.main-content').style.marginLeft = "0px";
  }
  </script>

<!--js for popup-->
<script>
  // When the user clicks on div, open the popup
  function myFunction() {
    var popup = document.getElementById("myPopup");
    popup.classList.toggle("show");
  }

</script>

  </body>
​
</html>
