<!DOCTYPE html>
<html>
  <head>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta charset="UTF-8">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
    <title>
       Le P&eacute;ch&eacute; Sacr&eacute;
    </title>
  </head>

  <body>
    <link rel="stylesheet" href="../css/peachgrove.css">
    <link rel="stylesheet" href="../css/timeline.css">
    <link rel="stylesheet" href="../css/popuptest.css">
    <link rel="stylesheet" href="../css/sad.css">
    <link rel="stylesheet" href="../css/footer.css">

  <!--NAVIGATION-->
  <nav class="sideNav">
    <a href="#" class="closeBtn">x</a>
    <a href="index-fr.html">Page d'accueil</a>
    <a href="marcypalace-fr.html">Palais Marcy</a>
    <a href="hallofwarriors-fr.html">Guerri&egrave;s</a>
    <a href="palacearena-fr.html">Invicta 2021</a>
    <a href="robot-fr.html">Robot</a>
    <a href="peachgrove-fr.html">Notre Histoire</a>
    <a href="noodleshop-fr.html">Alli&eacute;s</a>
    <a href="../index.html">Anglais</a>
</nav>

<button class="openSideNav">
    <div class="hamburger"></div>
    <div class="hamburger"></div>
    <div class="hamburger"></div>
</button>

  <h1 class="header-txt"> Le P&eacute;ch&eacute; Sacr&eacute; </h1>

<!--MASTER SHIFU-->

<aside class="popup" onclick="myFunction()">
  <img src="../images/icon-shifu.png" alt="Icon de Ma&icirc;tre Shifu" width="220px">
  <span class="popuptext" id="myPopup">Le temps est une illusion, il n&rsquo;y a que le pr&eacute;sent. C&rsquo;est l&agrave; que vous pourrez voir la pr&eacute;paration de nos guerri&egrave;res et apprendre de leurs erreurs pour devenir un meilleur guerrier, parce que nous apprenons tous des erreurs et r&eacute;ussites des autres.
  </span>
</aside>

<!--TIMELINE-->

    <section class="timeline">

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Inoubliable</h2>
          <video width="350" height="200" controls poster="../images/peachgrove/poster1.png">
            <source src="../images/peachgrove/highlights.mp4" type="video/mp4">
              Votre navigateur ne prend pas en charge la balise vid&eacute;o.
          </video>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">Le d&eacute;but d'une aventure</h2>
          <p class="text">Le 13 mars 2020, c&rsquo;est le d&eacute;but d&rsquo;un long confinement obligatoire qui a pris place alors que la pand&eacute;mie frappait de plein fouet le monde entier, y compris la Vall&eacute;e de la Paix. Pour lutter contre la pand&eacute;mie, ainsi que Invicta, la Vall&eacute;e de la Paix avait d&eacute;sesp&eacute;r&eacute;ment besoin d&rsquo;aide. C&rsquo;est alors qu&rsquo;une &eacute;quipe de 26 brillantes guerri&egrave;res a &eacute;t&eacute; form&eacute;e le 10 avril. </p>
          <img class="images" src="../images/peachgrove/team.jpg" alt="Une rencontre avec toutes les guerri&egrave;res">
          <p class="text">Alors que nous cherchions un moyen pour nous entra&icirc;ner toutes ensemble, le 6 mai, notre mentor nous a r&eacute;unies avec une technologie humaine appel&eacute;e ZOOM. C&rsquo;&eacute;tait le seul moyen de se voir. Le temps a pass&eacute;, et nous avons form&eacute; des sous-&eacute;quipes bas&eacute;es sur nos forces: la conception 3D, la programmation, la construction, la cr&eacute;ation d&rsquo;un site Web, la vid&eacute;o et la conception d&rsquo;un kiosque. Tous ces pouvoirs sont n&eacute;cessaires pour construire l&rsquo;arme parfaite pour vaincre Invicta. </p>
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Un nouvel ennemi: Invicta!</h2>
          <img class="images" src="../images/peachgrove/rob4.jpg" alt="Marie, Jessie et Alexia travaillent sur le robot">
          <p class="text">Le 31 août, nous avons appris une nouvelle d&eacute;vastatrice, Invicta avait d&eacute;truit tous les mat&eacute;riaux pour construire le kiosque, mais nous n&rsquo;avons pas abandonn&eacute;! Les guerri&egrave;res du kiosque ont redoubl&eacute; de force et se sont entra&icirc;n&eacute;es encore plus fort pour peaufiner leurs connaissances. Puis, le mois de septembre est arriv&eacute;, et nous nous sommes finalement retrouv&eacute;es au Palais Marcy. Chaque guerri&egrave;re a acquis de nouveaux savoirs et de plus amples pouvoirs. 
          </p>
        </div>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">L&eacute;gendes de g&eacute;nialit&eacute;</h2>
          <p class="text">Les guerri&egrave;res en construction et programmation ont travaill&eacute; fort durant ces longs mois. Pendant que celles de programmation apprenaient la langue tr&egrave;s complexe du codage avec Python, celles de construction, de leur c&ocirc;t&eacute;, se rencontraient gr&acirc;ce &agrave; des r&eacute;unions ZOOM pour faire des esquisses du robot. 
          </p>
          <img class="images" src="../images/peachgrove/prog2.jpg" alt="Liana et Aim&eacute;e travaillent sur le circuit">
          <p class="text">&Agrave; leur retour au Palais Marcy, en septembre, les guerri&egrave;res de construction ont d&eacute;fait l&rsquo;ancienne arme pour en construire une meilleure. Puis, l&rsquo;&eacute;quipe de programmation a cherch&eacute; diff&eacute;rents types de capteurs tout en apprenant davantage sur les circuits.
          </p>
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <video width="350" height="200" controls poster="../images/peachgrove/poster2.png">
            <source src="../images/peachgrove/robvid.MP4" type="video/mp4">
              Votre navigateur ne prend pas en charge la balise vidéo.
          </video>
          <img class="images" src="../images/peachgrove/rob6.jpg" alt="Une vue d'une moteur du robot">
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">De nouvelles comp&eacute;tences</h2>
          <p class="text">Avant l&rsquo;arriv&eacute;e de l&rsquo;&eacute;t&eacute;, l&rsquo;&eacute;quipe de vid&eacute;o a travaill&eacute; pour trouver une id&eacute;e et un contexte pour la vid&eacute;o. Pendant que les autres guerri&egrave;res profitaient des journ&eacute;es chaudes et ensoleill&eacute;es, celles en charge de la vid&eacute;o ont commenc&eacute; &agrave; cr&eacute;er des dialogues pour leurs personnages.</p>
          <img class="images" src="../images/peachgrove/vid1.jpg" alt="Une guerri&egrave;re travaille sur l'animation de la vid&eacute;o">
          <p class="text">De retour au Palais Marcy, elles ont ensuite essay&eacute; les techniques d&rsquo;animation, entre autres l&rsquo;animation de la bouche. En plus de cela, elles ont aussi d&eacute;but&eacute; l&rsquo;enregistrement des voix.</p>
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Skadoosh!</h2>
          <p class="text">D&egrave;s que nous avons toutes &eacute;t&eacute; r&eacute;unies, nous nous sommes mises &agrave; planifier le site. Pendant les vacances d&rsquo;&eacute;t&eacute;, nous avons s&eacute;par&eacute; l&rsquo;&eacute;quipe en deux: une &eacute;quipe qui apprenait le codage et une autre qui planifiait la configuration du site web.</p>
          <video width="350" height="200" controls poster="../images/peachgrove/poster3.png">
            <source src="../images/peachgrove/webvid.MOV" type="video/mp4">
              Votre navigateur ne prend pas en charge la balise vidéo.
          </video>
          <p class="text">&Agrave; notre retour au palais Marcy, nous avons officiellement commenc&eacute; &agrave; travailler sur le site web. Nous avons rencontr&eacute; plusieurs difficult&eacute;s, dont l&rsquo;int&eacute;gration d&rsquo;une carte en 3D pour notre page principale, mais nous les avons surmont&eacute;s.
          </p>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">Imbattables</h2>
          <img class="images" src="../images/peachgrove/3d1.jpg" alt="Une guerri&egrave;re travaille sur les mod&egrave;les 3D">
          <p class="text">Pendant l&rsquo;&eacute;t&eacute;, l&rsquo;&eacute;quipe de dessin 3D a pratiqu&eacute; l&rsquo;animation des objets avec l&rsquo;aide d&rsquo;une plateforme connue sous le nom de Inventor. Puis, en octobre, les filles ont officiellement commenc&eacute; leur travail, dont l&rsquo;animation des robots pour le tutoriel.
          </p>
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">La bataille a commenc&eacute;!</h2>
          <p class="text">Le 2 novembre, les d&eacute;tails de la bataille contre Invicta ont &eacute;t&eacute; r&eacute;v&eacute;l&eacute;s et chaque guerri&egrave;re a pu r&eacute;ellement se mettre au travail. L&rsquo;&eacute;quipe qui s&rsquo;occupe de l&rsquo;arme a pu commenc&eacute; &agrave; cr&eacute;er les plans et &agrave; mettre leurs connaissances au d&eacute;fi. </p>
          <img class="images" src="../images/peachgrove/prog3.jpg" alt="Les guerri&egrave;res de programmation essaient le circuit du robot">
          <p class="text">En quelques jours, elles sont toutes arriv&eacute;es avec des plans diff&eacute;rents tout aussi ing&eacute;nieux les uns  que les autres. Elles ont mis leurs id&eacute;es en commun et ont pu cr&eacute;er leur premier plan de l&rsquo;arme. </p>
          <img class="images" src="../images/peachgrove/rob7.jpg" alt="Les guerri&egrave;re essaient le robot sur le terrain de jeu">
          <p class="text">Rien n&rsquo;&eacute;tait coul&eacute; dans le b&eacute;ton, car depuis le 2 novembre le plan a sans cesse &eacute;volu&eacute;. Avec les contraintes sanitaires, le travail a &eacute;t&eacute; un peu plus ardu, mais rien n&rsquo;est impossible pour nos guerri&egrave;res!</p>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <img class="images" src="../images/peachgrove/rob2.jpg" alt="Marie pointe un m&egrave;tre &agrave; ruban &agrave; la cam&eacute;ra">
          <img class="images" src="../images/peachgrove/web6.jpg" alt="Catherine et Camille posent pour la cam&eacute;ra">
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Au travail!</h2>
          <p class="text">Les guerri&egrave;res s&rsquo;occupant de la vid&eacute;o avaient d&eacute;j&agrave; commenc&eacute; leur travail, donc suite au lancement de la comp&eacute;tition, elles ont finalis&eacute; les dessins pour l&rsquo;animation et elles ont finalis&eacute; le script en ajoutant quelques d&eacute;tails. </p>
          <img class="images" src="../images/peachgrove/vid2.JPG" alt="Erika travaille sur l'animation de la vid&eacute;o">
          <p class="text">&Agrave; la mi-novembre, elles ont film&eacute; les quelques sc&egrave;nes dont elles avaient besoin. Avec le logiciel After effects, elles ont finalement commenc&eacute; &agrave; animer. Elles ont dû se familiariser avec le logiciel et apprendre plusieurs techniques pour que l&rsquo;animation fonctionne. Celle-ci prend beaucoup de temps, car il faut des dessins diff&eacute;rents pour chaque mouvement et il est primordial de s&rsquo;assurer qu&rsquo;ils se suivent.</p>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader"><i>K.I.S.S.</i></h2>
          <p class="text">En d&eacute;cembre, le deuxi&egrave;me prototype est mis &agrave; l&rsquo;&eacute;preuve. Gr&acirc;ce &agrave; ce deuxi&egrave;me prototype, les guerri&egrave;res ont pu d&eacute;couvrir les petits p&eacute;pins dans la fabrication et pourront les am&eacute;liorer!  </p>
          <video width="350" height="200" controls>
            <source src="../images/peachgrove/robvid1.MOV" type="video/mp4">
              Votre navigateur ne prend pas en charge la balise vidéo.
          </video>
          <p class="text">Les programmeuses, de leur c&ocirc;t&eacute;, ont pu commenc&eacute; &agrave; &eacute;crire le code final pour le robot. Avec le CRC duino, leurs connaissances, et quelques moteurs et capteurs, elles ont essay&eacute; leur code. Malheureusement les premi&egrave;res fois, il n&rsquo;a pas fonctionn&eacute;, mais elles n&rsquo;ont pas baiss&eacute; les bras et ont essay&eacute; d&rsquo;arranger leur ligne de code. En plus de cela, pour acqu&eacute;rir le plus de connaissances possible, elles ont continu&eacute; de tenter de r&eacute;soudre leur probl&egrave;me de programmation. Durant le mois de d&eacute;cembre, elles devaient trouver un code qui permettrait de r&eacute;soudre n&rsquo;importe quel casse-t&ecirc;te de sudoku. </p>
          <img class="images" src="../images/peachgrove/prog1.jpeg" alt="Aimee programme le circuit">
          </div>
      </div>

      <div class="container right">
        <div class="content">
          <img class="images" src="../images/peachgrove/prog4.jpg" alt="Le robot circuit">
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">Surmonter de nouveaux obstacles</h2>
          <p class="text">L&rsquo;&eacute;quipe qui se charge du site web a beaucoup avanc&eacute;. Elle a finalis&eacute; son plan et a pu commenc&eacute; &agrave; faire les pages. Le plus gros d&eacute;fi &eacute;tait l&rsquo;insertion du dessin 3D de notre page principale. Nous avons dû demander de l&rsquo;aide &agrave; la CRC. </p>
          <img class="images" src="../images/peachgrove/web7.jpg" alt="L'&eacute;quipe de site web suite &agrave; la s&eacute;ance de photos">
          <p class="text">Sans rel&acirc;che, les guerri&egrave;res qui s&rsquo;occupent du site ont essay&eacute; de r&eacute;parer les probl&egrave;mes rencontr&eacute;s comme l&rsquo;image de fond qui n&rsquo;apparaissait pas ou les codes qui ne fonctionnaient pas. Un autre d&eacute;fi &eacute;tait de cr&eacute;er deux sites web en m&ecirc;me temps. Nous avons dû s&eacute;parer les t&acirc;ches m&eacute;ticuleusement pour &ecirc;tre certaines de les achever dans les temps pr&eacute;vus  </p>
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Le temps presse</h2>
          <p class="text">Finalement l&rsquo;&eacute;quipe s&rsquo;occupant des dessins 3D a travaill&eacute; sur le tutoriel, ce qui s&rsquo;est av&eacute;r&eacute; plus long que pr&eacute;vu. Sans jamais baisser les bras, les guerri&egrave;res ont travaill&eacute; sur ce tutoriel pendant les mois de novembre et d&eacute;cembre. De plus, elles ont aid&eacute; les autres guerri&egrave;res en dessinant le terrain de combat et en cr&eacute;ant le mod&egrave;le 3D de la carte du monde de Kung Fu Panda pour le site web.  <br><br>
            <video width="320" height="200" controls poster="../images/peachgrove/poster4.png">
              <source src="../images/peachgrove/3d-interview.mp4" type="video/mp4">
                Votre navigateur ne prend pas en charge la balise vid&eacute;o.
            </video>
            <br><br>Les mois de novembre et de d&eacute;cembre ont &eacute;t&eacute; remplis de d&eacute;fis, mais aussi de r&eacute;ussites. Il ne restait plus que deux mois avant la bataille finale.</p>
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <img class="images" src="../images/peachgrove/rob9.jpeg" alt="Sabrina et Jessie avec le robot">
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Ma&icirc;tres de la r&eacute;solution de probl&egrave;mes</h2>
          <p class="text">Depuis le mois de janvier, le <i>intake</i> a re&ccedil;u de nombreuses modifications. Selon le premier prototype, il &eacute;tait plac&eacute; horizontalement contre le sol. Au mois de mars, il a &eacute;t&eacute; chang&eacute; de place par du plexiglas inclin&eacute; selon un certain angle. Pour immobiliser le bras, une poulie y est attach&eacute;e. Le design du robot est rest&eacute; similaire &agrave; celui du plan initial.  <br><br>
            <video width="320" height="200" controls poster="../images/peachgrove/poster5.png">
              <source src="../images/peachgrove/robvid2.MP4" type="video/mp4">
                Votre navigateur ne prend pas en charge la balise vid&eacute;o.
            </video><br><br>
            De plus, des ascenseurs horizontaux lin&eacute;aires ont &eacute;t&eacute; ajout&eacute;s au pivot. La rotation du <i>intake</i> et l&rsquo;extension ont &eacute;t&eacute; les changements majeurs apport&eacute;s sur le robot. Les guerri&egrave;res ont d&eacute;cid&eacute; de mettre l&rsquo;extension sur le <i>intake</i>.
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">Combattants de r&eacute;silience</h2>
          <p class="text">Le robot arrivant &agrave; sa derni&egrave;re &eacute;tape de construction, les guerri&egrave;res s&rsquo;occupant de la vid&eacute;o ont pu finir l&rsquo;explication du robot. De plus, elles ont dessin&eacute; la majorit&eacute; des plans. Comme la date de la remise approche &agrave; grands pas, les guerri&egrave;res ont travaill&eacute; tr&egrave;s fort pour compl&eacute;ter la derni&egrave;re sc&egrave;ne. 
          </p>
          <img class="images" src="../images/peachgrove/prog5.jpg" alt="Liana travaille sur le circuit">
        </div>
      </div>

      <div class="container right">
        <div class="content">
          <h2 class="subheader">Soyez toujours pr&eacute;par&eacute;s</h2>
          <p class="text">Chaque &eacute;quipe a &eacute;t&eacute; interrog&eacute; entre les mois de janvier et mars. En mars, l&rsquo;&eacute;quipe s&rsquo;occupant du design du site web a dû abandonner le plan de la carte 3D. En cons&eacute;quence, les guerri&egrave;res ont d&eacute;clench&eacute; le plan B et ont dessin&eacute; une carte en 2D. Les guerri&egrave;res journalistes ont travaill&eacute; sur les sous-titres des vid&eacute;os.<br><br>
            <img class="images" src="../images/peachgrove/web1.jpeg" alt="L'&eacute;quipe de site web prend des photos de l'&eacute;quipe">
        </div>
      </div>

      <div class="container left">
        <div class="content">
          <h2 class="subheader">Une derni&egrave;re pouss&eacute;e</h2>
          <p class="text"> Les donn&eacute;es &eacute;tant suffisantes, l&rsquo;&eacute;quipe de dessin 3D a commenc&eacute; l&rsquo;animation et la mod&eacute;lisation 3D du robot et du terrain. Deux semaines avant de soumettre le site web, l&rsquo;&eacute;quipe a donn&eacute; les animations, les tutoriels et les dessins &agrave; l&rsquo;&eacute;quipe s&rsquo;occupant de site web et &agrave; l&rsquo;&eacute;quipe s&rsquo;occupant de la vid&eacute;o.</p>
          <img class="images" src="../images/peachgrove/web5.JPG" alt="Une guerri&egrave;re de site web travaille sur le code">
        </div>
      </div>
    </section>

<!--FOOTER-->
<footer>
  <section class="ft-main">
  <section class="ft-section">
      <h2 class="ft-title">Explorez</h2>
      <ul class="u-list">
        <li class="list-item"><a href="index-fr.html" class="ft-link">Page d'accueil</a></li>
        <li class="list-item"><a href="../french/marcypalace-fr.html" class="ft-link">Palais Marcy</a></li>
        <li class="list-item"><a href="../french/hallofwarriors-fr.html" class="ft-link">Guerri&egrave;s</a></li>
        <li class="list-item"><a href="../french/palacearena-fr.html" class="ft-link">Invicta 2021</a></li>
        <li class="list-item"><a href="../french/robot-fr.html" class="ft-link">Robot</a></li>
        <li class="list-item"><a href="../french/peachgrove-fr.html" class="ft-link">Notre Histoire</a></li>
        <li class="list-item"><a href="../french/noodleshop-fr.html" class="ft-link">Alli&eacute;s</a></li>
        <li class="list-item"><a href="../index.html" class="ft-link">Anglais</a></li>
      </ul>
  </section>
  <section class="ft-section">
      <h2 class="ft-title">Remerciements</h2>
        <p>Dessins par Victoria Hoang</p>
        <p>Photos par Emily Hoang, Camille Jean-Fran&ccedil;ois et Catherine Louca</p>
        <p>Bas&eacute; sur Kung Fu Panda de DreamWorks</p>
      <br>
      <p>&copy; 2021 Robotique Marcelline</p>
  </section>
  </section>
</footer>

<script>
  let openBtn = document.querySelector(".openSideNav");
  openBtn.addEventListener("click", () => {
     showNav();
  });
  let closeBtn = document.querySelector(".closeBtn");
  closeBtn.addEventListener("click", () => {
     hideNav();
  });
  function showNav() {
     document.querySelector(".sideNav").style.width = "300px";
     document.querySelector('.main-content').style.marginLeft = "300px";
  }
  function hideNav() {
     document.querySelector(".sideNav").style.width = "0";
     document.querySelector('.main-content').style.marginLeft = "0px";
  }
  </script>

    <!--js for popup-->
    <script>
      // When the user clicks on div, open the popup
      function myFunction() {
        var popup = document.getElementById("myPopup");
        popup.classList.toggle("show");
      }

    </script>

  </body>
</html>
